<?php

namespace Xefi\Faker\BeBy\Extensions;

use Xefi\Faker\Extensions\ColorsExtension as BaseColorsExtension;

class ColorsExtension extends BaseColorsExtension
{
    public function getLocale(): string|null
    {
        return 'be_BY';
    }

    protected array $safeColorNames = [
        'Чорны', 'Цёмна-чырвоны', 'Зялёны', 'Цёмна-сіні', 'Аліўкавы',
        'Пурпурны', 'Сіне-зялёны', 'Лаймавы', 'Сіні', 'Серабрысты',
        'Шэры', 'Жоўты', 'Фуксія', 'Блакітны', 'Белы',
    ];

    protected array $colorNames = [
        'Чорны', 'Цёмна-чырвоны', 'Зялёны', 'Цёмна-сіні', 'Аліўкавы',
        'Пурпурны', 'Сіне-зялёны', 'Лаймавы', 'Сіні', 'Серабрысты',
        'Шэры', 'Жоўты', 'Фуксія', 'Блакітны', 'Белы',
        'Чырвоны', 'Аранжавы', 'Ружовы', 'Брунатны', 'Залаты',
        'Бэжавы', 'Кармінавы', 'Малінавы', 'Каралавы', 'Персікавы',
        'Лавандавы', 'Бірузовы', 'Індыга', 'Слівавы', 'Шакаладны',
        'Пясочны', 'Жамчужны', 'Бураковы', 'Вішнёвы', 'Мятны',
        'Смарагдавы', 'Нефрытавы', 'Васільковы', 'Лазурны', 'Нябесны',
        'Бэзавы', 'Ліловы', 'Шафранавы', 'Бурштынавы', 'Мядовы',
        'Цытрынавы', 'Каштанавы', 'Рыжы', 'Графітавы', 'Попельны',
        'Бронзавы', 'Медны', 'Мандарынавы', 'Абрыкосавы', 'Вінны',
        'Рубінавы', 'Сапфіравы', 'Кававы', 'Хакі', 'Цагляны',
        'Тэракотавы', 'Фіялетавы', 'Малахітавы', 'Шэра-блакітны', 'Цёмна-зялёны',
        'Светла-зялёны', 'Светла-сіні', 'Светла-шэры', 'Цёмна-шэры', 'Яблычны',
    ];
}
