<?php

namespace Xefi\Faker\BeBy\Extensions;

use Xefi\Faker\Extensions\PersonExtension as BasePersonExtension;

class PersonExtension extends BasePersonExtension
{
    public function getLocale(): ?string
    {
        return 'be_BY';
    }

    protected $firstNameMale = [
        'Аляксандр', 'Дзмітрый', 'Максім', 'Сяргей', 'Андрэй', 'Аляксей', 'Арцём', 'Ілья', 'Кірыл', 'Мікіта',
        'Мікалай', 'Уладзімір', 'Іван', 'Яўген', 'Павел', 'Раман', 'Руслан', 'Канстанцін', 'Дзяніс', 'Антон',
        'Віктар', 'Васіль', 'Генадзь', 'Ягор', 'Уладзіслаў', 'Вадзім', 'Алег', 'Ігар', 'Віталь', 'Анатоль',
        'Юры', 'Міхаіл', 'Пётр', 'Барыс', 'Станіслаў', 'Валянцін', 'Валерый', 'Леанід', 'Усевалад', 'Даніла',
        'Багдан', 'Ян', 'Мацвей', 'Цімафей', 'Эдуард',
    ];

    protected $firstNameFemale = [
        'Вольга', 'Наталля', 'Кацярына', 'Ганна', 'Анастасія', 'Марыя', 'Святлана', 'Таццяна', 'Ірына', 'Алена',
        'Юлія', 'Алеся', 'Вікторыя', 'Дар\'я', 'Вераніка', 'Ксенія', 'Людміла', 'Аксана', 'Марына', 'Валянціна',
        'Надзея', 'Яўгенія', 'Тамара', 'Галіна', 'Лілія', 'Крысціна', 'Мілана', 'Паліна', 'Соф\'я', 'Ева',
        'Аліна', 'Яна', 'Вера', 'Любоў', 'Ларыса', 'Іна', 'Ульяна', 'Мар\'яна', 'Антаніна', 'Лідзія',
        'Раіса', 'Жана', 'Ядвіга', 'Алла', 'Паўліна',
    ];

    /**
     * Masculine form => feminine form.
     */
    protected $lastName = [
        'Іваноў' => 'Іванова', 'Кавалёў' => 'Кавалёва', 'Шаўчэнка' => 'Шаўчэнка', 'Новік' => 'Новік',
        'Кароткі' => 'Кароткая', 'Мельнік' => 'Мельнік', 'Жук' => 'Жук', 'Лукашэвіч' => 'Лукашэвіч',
        'Грыбоўскі' => 'Грыбоўская', 'Кісялёў' => 'Кісялёва', 'Сідарэнка' => 'Сідарэнка', 'Паўлаў' => 'Паўлава',
        'Пятроў' => 'Пятрова', 'Смірноў' => 'Смірнова', 'Карповіч' => 'Карповіч', 'Бандарэнка' => 'Бандарэнка',
        'Кузняцоў' => 'Кузняцова', 'Мароз' => 'Мароз', 'Лявонаў' => 'Лявонава', 'Ярмоленка' => 'Ярмоленка',
        'Цімашэнка' => 'Цімашэнка', 'Раманчук' => 'Раманчук', 'Станкевіч' => 'Станкевіч',
        'Кавалеўскі' => 'Кавалеўская', 'Данілаў' => 'Данілава', 'Кулеш' => 'Кулеш', 'Гарбачоў' => 'Гарбачова',
        'Вераб\'ёў' => 'Вераб\'ёва', 'Мікалаеў' => 'Мікалаева', 'Чарняўскі' => 'Чарняўская', 'Баранаў' => 'Баранава',
        'Белы' => 'Белая', 'Захарчук' => 'Захарчук', 'Валюк' => 'Валюк', 'Мазуркевіч' => 'Мазуркевіч',
        'Шыманскі' => 'Шыманская', 'Рудэнка' => 'Рудэнка', 'Васільеў' => 'Васільева', 'Казлоў' => 'Казлова',
        'Кавальчук' => 'Кавальчук',
    ];

    protected $titleMale = ['спадар', 'д-р', 'праф.'];
    protected $titleFemale = ['спадарыня', 'д-р', 'праф.'];

    public function name(?string $gender = null): string
    {
        $gender ??= $this->randomizer->getInt(0, 1) === 0 ? static::GENDER_FEMALE : static::GENDER_MALE;

        return sprintf('%s %s', $this->firstName($gender), $this->lastName($gender));
    }

    public function lastName(?string $gender = null): string
    {
        $gender ??= $this->randomizer->getInt(0, 1) === 0 ? static::GENDER_FEMALE : static::GENDER_MALE;

        $masculine = $this->pickArrayRandomElement(array_keys($this->lastName));

        return $gender === static::GENDER_FEMALE ? $this->lastName[$masculine] : $masculine;
    }
}
